_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_2 (Reshape)          (None, 28, 28, 1)         0         
_________________________________________________________________
random_rotation_2 (RandomRot (None, 28, 28, 1)         0         
_________________________________________________________________
random_height_2 (RandomHeigh (None, None, 28, 1)       0         
_________________________________________________________________
random_width_2 (RandomWidth) (None, None, None, 1)     0         
_________________________________________________________________
random_translation_2 (Random (None, None, None, 1)     0         
_________________________________________________________________
resizing_2 (Resizing)        (None, 28, 28, 1)         0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 28, 28, 32)        320       
_________________________________________________________________
batch_normalization_14 (Batc (None, 28, 28, 32)        112       
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 26, 26, 32)        9248      
_________________________________________________________________
batch_normalization_15 (Batc (None, 26, 26, 32)        104       
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 13, 13, 32)        25632     
_________________________________________________________________
batch_normalization_16 (Batc (None, 13, 13, 32)        52        
_________________________________________________________________
dropout_6 (Dropout)          (None, 13, 13, 32)        0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 11, 11, 64)        18496     
_________________________________________________________________
batch_normalization_17 (Batc (None, 11, 11, 64)        44        
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 9, 9, 64)          36928     
_________________________________________________________________
batch_normalization_18 (Batc (None, 9, 9, 64)          36        
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 5, 5, 64)          102464    
_________________________________________________________________
batch_normalization_19 (Batc (None, 5, 5, 64)          20        
_________________________________________________________________
dropout_7 (Dropout)          (None, 5, 5, 64)          0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_6 (Dense)              (None, 256)               409856    
_________________________________________________________________
dropout_8 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 28)                7196      
_________________________________________________________________
batch_normalization_20 (Batc (None, 28)                112       
_________________________________________________________________
dense_8 (Dense)              (None, 10)                290       
=================================================================
Total params: 610,910
Trainable params: 610,670
Non-trainable params: 240